sdaiIsSDAISubtypeOf(Sdai_instS*,Sdai_instS*)
\details
Determines whether a specified SDAI data type is a subtype of another SDAI data type (supertype).
\param subtype   [in] An entity that represents the SDAI data type to be checked.
\param supertype [in] An entity that represents the SDAI supertype.
\returns sdaiTRUE if the specified SDAI data type is a subtype of the specified supertype; otherwise, the function returns sdaiFALSE.
\remarks
This function is not implemented yet.
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiRP_NOPN - Repository is not open.
* sdaiED_NDEF - Entity definition not defined.
* sdaiED_NDEQ - Entity definition not domain equivalent.
* sdaiSD_NDEF - Schema definition not defined.
* sdaiFN_NAVL - Function not available.
* sdaiSY_ERR - Underlying system error.